; domain
(define (domain joint_car-assistance1_domain)
(:requirements :typing :action-costs)

(:types
    place car - object
)

(:constants
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (adj-walk ?s1 - place ?s2 -  place)
    (adj-car ?s1 - place ?s2 -  place)
    (at-supporter ?s -  place)
    (at-car ?car - car ?s -  place)
    (supporter-inside ?car -  car)
    (free ?car -  car)
    (at-prime ?s -  place)
    (prime-inside ?car -  car)
)

(:functions
    (total-cost) - number
)

(:action sup_walk-supporter
    :parameters (?from - place ?to - place)
    :precondition (and
        (supporter_turn)
        (adj-walk ?from ?to)
        (at-supporter ?from)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-supporter ?to)
        (not (at-supporter ?from))
        (increase (total-cost) 1.0)
    )
)

(:action sup_get-into-car-supporter
    :parameters (?position - place ?car - car)
    :precondition (and
        (supporter_turn)
        (at-supporter ?position)
        (at-car ?car ?position)
        (free ?car)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (supporter-inside ?car)
        (not (at-supporter ?position))
        (not (free ?car))
        (increase (total-cost) 1.0)
    )
)

(:action sup_get-out-car-supporter
    :parameters (?position - place ?car - car)
    :precondition (and
        (supporter_turn)
        (supporter-inside ?car)
        (at-car ?car ?position)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-supporter ?position)
        (free ?car)
        (not (supporter-inside ?car))
        (increase (total-cost) 1.0)
    )
)

(:action sup_drive-supporter
    :parameters (?from - place ?to - place ?car - car)
    :precondition (and
        (supporter_turn)
        (adj-car ?from ?to)
        (at-car ?car ?from)
        (supporter-inside ?car)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-car ?car ?to)
        (not (at-car ?car ?from))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk-prime
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_get-into-car-prime
    :parameters (?position - place ?car - car)
    :precondition (and
        (prime_turn)
        (at-prime ?position)
        (at-car ?car ?position)
        (free ?car)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (prime-inside ?car)
        (not (at-prime ?position))
        (not (free ?car))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_get-out-car-prime
    :parameters (?position - place ?car - car)
    :precondition (and
        (prime_turn)
        (prime-inside ?car)
        (at-car ?car ?position)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?position)
        (free ?car)
        (not (prime-inside ?car))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_drive-prime
    :parameters (?from - place ?to - place ?car - car)
    :precondition (and
        (prime_turn)
        (adj-car ?from ?to)
        (at-car ?car ?from)
        (prime-inside ?car)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-car ?car ?to)
        (not (at-car ?car ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_car-assistance1_problem_9)
(:domain joint_car-assistance1_domain)
(:objects
    pos0-8 pos0-9 pos0-10 pos0-11 pos0-12 pos0-13 pos1-7 pos1-8 pos1-9 pos1-10 pos1-11 pos1-12 pos1-13 pos2-7 pos2-8 pos2-9 pos2-10 pos2-11 pos2-12 pos2-13 pos3-4 pos3-5 pos3-6 pos3-7 pos3-8 pos3-9 pos3-10 pos3-11 pos3-13 pos4-6 pos4-8 pos4-10 pos4-12 pos4-13 - place
    car0 - car
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (adj-walk pos0-8 pos0-9)
    (adj-walk pos0-9 pos0-8)
    (adj-walk pos0-8 pos1-8)
    (adj-walk pos1-8 pos0-8)
    (adj-car pos0-8 pos0-9)
    (adj-car pos0-9 pos0-8)
    (adj-car pos0-8 pos0-10)
    (adj-car pos0-10 pos0-8)
    (adj-car pos0-8 pos0-11)
    (adj-car pos0-11 pos0-8)
    (adj-car pos0-8 pos1-8)
    (adj-car pos1-8 pos0-8)
    (adj-car pos0-8 pos2-8)
    (adj-car pos2-8 pos0-8)
    (adj-car pos0-8 pos3-8)
    (adj-car pos3-8 pos0-8)
    (adj-walk pos0-9 pos0-10)
    (adj-walk pos0-10 pos0-9)
    (adj-walk pos0-9 pos1-9)
    (adj-walk pos1-9 pos0-9)
    (adj-car pos0-9 pos0-10)
    (adj-car pos0-10 pos0-9)
    (adj-car pos0-9 pos0-11)
    (adj-car pos0-11 pos0-9)
    (adj-car pos0-9 pos0-12)
    (adj-car pos0-12 pos0-9)
    (adj-car pos0-9 pos1-9)
    (adj-car pos1-9 pos0-9)
    (adj-car pos0-9 pos2-9)
    (adj-car pos2-9 pos0-9)
    (adj-car pos0-9 pos3-9)
    (adj-car pos3-9 pos0-9)
    (adj-walk pos0-10 pos0-11)
    (adj-walk pos0-11 pos0-10)
    (adj-walk pos0-10 pos1-10)
    (adj-walk pos1-10 pos0-10)
    (adj-car pos0-10 pos0-11)
    (adj-car pos0-11 pos0-10)
    (adj-car pos0-10 pos0-12)
    (adj-car pos0-12 pos0-10)
    (adj-car pos0-10 pos0-13)
    (adj-car pos0-13 pos0-10)
    (adj-car pos0-10 pos1-10)
    (adj-car pos1-10 pos0-10)
    (adj-car pos0-10 pos2-10)
    (adj-car pos2-10 pos0-10)
    (adj-car pos0-10 pos3-10)
    (adj-car pos3-10 pos0-10)
    (adj-walk pos0-11 pos0-12)
    (adj-walk pos0-12 pos0-11)
    (adj-walk pos0-11 pos1-11)
    (adj-walk pos1-11 pos0-11)
    (adj-car pos0-11 pos0-12)
    (adj-car pos0-12 pos0-11)
    (adj-car pos0-11 pos0-13)
    (adj-car pos0-13 pos0-11)
    (adj-car pos0-11 pos1-11)
    (adj-car pos1-11 pos0-11)
    (adj-car pos0-11 pos2-11)
    (adj-car pos2-11 pos0-11)
    (adj-car pos0-11 pos3-11)
    (adj-car pos3-11 pos0-11)
    (adj-walk pos0-12 pos0-13)
    (adj-walk pos0-13 pos0-12)
    (adj-walk pos0-12 pos1-12)
    (adj-walk pos1-12 pos0-12)
    (adj-car pos0-12 pos0-13)
    (adj-car pos0-13 pos0-12)
    (adj-car pos0-12 pos1-12)
    (adj-car pos1-12 pos0-12)
    (adj-car pos0-12 pos2-12)
    (adj-car pos2-12 pos0-12)
    (adj-walk pos0-13 pos1-13)
    (adj-walk pos1-13 pos0-13)
    (adj-car pos0-13 pos1-13)
    (adj-car pos1-13 pos0-13)
    (adj-car pos0-13 pos2-13)
    (adj-car pos2-13 pos0-13)
    (adj-car pos0-13 pos3-13)
    (adj-car pos3-13 pos0-13)
    (adj-walk pos1-7 pos1-8)
    (adj-walk pos1-8 pos1-7)
    (adj-walk pos1-7 pos2-7)
    (adj-walk pos2-7 pos1-7)
    (adj-car pos1-7 pos1-8)
    (adj-car pos1-8 pos1-7)
    (adj-car pos1-7 pos1-9)
    (adj-car pos1-9 pos1-7)
    (adj-car pos1-7 pos1-10)
    (adj-car pos1-10 pos1-7)
    (adj-car pos1-7 pos2-7)
    (adj-car pos2-7 pos1-7)
    (adj-car pos1-7 pos3-7)
    (adj-car pos3-7 pos1-7)
    (adj-walk pos1-8 pos1-9)
    (adj-walk pos1-9 pos1-8)
    (adj-walk pos1-8 pos2-8)
    (adj-walk pos2-8 pos1-8)
    (adj-car pos1-8 pos1-9)
    (adj-car pos1-9 pos1-8)
    (adj-car pos1-8 pos1-10)
    (adj-car pos1-10 pos1-8)
    (adj-car pos1-8 pos1-11)
    (adj-car pos1-11 pos1-8)
    (adj-car pos1-8 pos2-8)
    (adj-car pos2-8 pos1-8)
    (adj-car pos1-8 pos3-8)
    (adj-car pos3-8 pos1-8)
    (adj-car pos1-8 pos4-8)
    (adj-car pos4-8 pos1-8)
    (adj-walk pos1-9 pos1-10)
    (adj-walk pos1-10 pos1-9)
    (adj-walk pos1-9 pos2-9)
    (adj-walk pos2-9 pos1-9)
    (adj-car pos1-9 pos1-10)
    (adj-car pos1-10 pos1-9)
    (adj-car pos1-9 pos1-11)
    (adj-car pos1-11 pos1-9)
    (adj-car pos1-9 pos1-12)
    (adj-car pos1-12 pos1-9)
    (adj-car pos1-9 pos2-9)
    (adj-car pos2-9 pos1-9)
    (adj-car pos1-9 pos3-9)
    (adj-car pos3-9 pos1-9)
    (adj-walk pos1-10 pos1-11)
    (adj-walk pos1-11 pos1-10)
    (adj-walk pos1-10 pos2-10)
    (adj-walk pos2-10 pos1-10)
    (adj-car pos1-10 pos1-11)
    (adj-car pos1-11 pos1-10)
    (adj-car pos1-10 pos1-12)
    (adj-car pos1-12 pos1-10)
    (adj-car pos1-10 pos1-13)
    (adj-car pos1-13 pos1-10)
    (adj-car pos1-10 pos2-10)
    (adj-car pos2-10 pos1-10)
    (adj-car pos1-10 pos3-10)
    (adj-car pos3-10 pos1-10)
    (adj-car pos1-10 pos4-10)
    (adj-car pos4-10 pos1-10)
    (adj-walk pos1-11 pos1-12)
    (adj-walk pos1-12 pos1-11)
    (adj-walk pos1-11 pos2-11)
    (adj-walk pos2-11 pos1-11)
    (adj-car pos1-11 pos1-12)
    (adj-car pos1-12 pos1-11)
    (adj-car pos1-11 pos1-13)
    (adj-car pos1-13 pos1-11)
    (adj-car pos1-11 pos2-11)
    (adj-car pos2-11 pos1-11)
    (adj-car pos1-11 pos3-11)
    (adj-car pos3-11 pos1-11)
    (adj-walk pos1-12 pos1-13)
    (adj-walk pos1-13 pos1-12)
    (adj-walk pos1-12 pos2-12)
    (adj-walk pos2-12 pos1-12)
    (adj-car pos1-12 pos1-13)
    (adj-car pos1-13 pos1-12)
    (adj-car pos1-12 pos2-12)
    (adj-car pos2-12 pos1-12)
    (adj-walk pos1-13 pos2-13)
    (adj-walk pos2-13 pos1-13)
    (adj-car pos1-13 pos2-13)
    (adj-car pos2-13 pos1-13)
    (adj-car pos1-13 pos3-13)
    (adj-car pos3-13 pos1-13)
    (adj-car pos1-13 pos4-13)
    (adj-car pos4-13 pos1-13)
    (adj-walk pos2-7 pos2-8)
    (adj-walk pos2-8 pos2-7)
    (adj-walk pos2-7 pos3-7)
    (adj-walk pos3-7 pos2-7)
    (adj-car pos2-7 pos2-8)
    (adj-car pos2-8 pos2-7)
    (adj-car pos2-7 pos2-9)
    (adj-car pos2-9 pos2-7)
    (adj-car pos2-7 pos2-10)
    (adj-car pos2-10 pos2-7)
    (adj-car pos2-7 pos3-7)
    (adj-car pos3-7 pos2-7)
    (adj-walk pos2-8 pos2-9)
    (adj-walk pos2-9 pos2-8)
    (adj-walk pos2-8 pos3-8)
    (adj-walk pos3-8 pos2-8)
    (adj-car pos2-8 pos2-9)
    (adj-car pos2-9 pos2-8)
    (adj-car pos2-8 pos2-10)
    (adj-car pos2-10 pos2-8)
    (adj-car pos2-8 pos2-11)
    (adj-car pos2-11 pos2-8)
    (adj-car pos2-8 pos3-8)
    (adj-car pos3-8 pos2-8)
    (adj-car pos2-8 pos4-8)
    (adj-car pos4-8 pos2-8)
    (adj-walk pos2-9 pos2-10)
    (adj-walk pos2-10 pos2-9)
    (adj-walk pos2-9 pos3-9)
    (adj-walk pos3-9 pos2-9)
    (adj-car pos2-9 pos2-10)
    (adj-car pos2-10 pos2-9)
    (adj-car pos2-9 pos2-11)
    (adj-car pos2-11 pos2-9)
    (adj-car pos2-9 pos2-12)
    (adj-car pos2-12 pos2-9)
    (adj-car pos2-9 pos3-9)
    (adj-car pos3-9 pos2-9)
    (adj-walk pos2-10 pos2-11)
    (adj-walk pos2-11 pos2-10)
    (adj-walk pos2-10 pos3-10)
    (adj-walk pos3-10 pos2-10)
    (adj-car pos2-10 pos2-11)
    (adj-car pos2-11 pos2-10)
    (adj-car pos2-10 pos2-12)
    (adj-car pos2-12 pos2-10)
    (adj-car pos2-10 pos2-13)
    (adj-car pos2-13 pos2-10)
    (adj-car pos2-10 pos3-10)
    (adj-car pos3-10 pos2-10)
    (adj-car pos2-10 pos4-10)
    (adj-car pos4-10 pos2-10)
    (adj-walk pos2-11 pos2-12)
    (adj-walk pos2-12 pos2-11)
    (adj-walk pos2-11 pos3-11)
    (adj-walk pos3-11 pos2-11)
    (adj-car pos2-11 pos2-12)
    (adj-car pos2-12 pos2-11)
    (adj-car pos2-11 pos2-13)
    (adj-car pos2-13 pos2-11)
    (adj-car pos2-11 pos3-11)
    (adj-car pos3-11 pos2-11)
    (adj-walk pos2-12 pos2-13)
    (adj-walk pos2-13 pos2-12)
    (adj-car pos2-12 pos2-13)
    (adj-car pos2-13 pos2-12)
    (adj-walk pos2-13 pos3-13)
    (adj-walk pos3-13 pos2-13)
    (adj-car pos2-13 pos3-13)
    (adj-car pos3-13 pos2-13)
    (adj-car pos2-13 pos4-13)
    (adj-car pos4-13 pos2-13)
    (adj-walk pos3-4 pos3-5)
    (adj-walk pos3-5 pos3-4)
    (adj-car pos3-4 pos3-5)
    (adj-car pos3-5 pos3-4)
    (adj-car pos3-4 pos3-6)
    (adj-car pos3-6 pos3-4)
    (adj-car pos3-4 pos3-7)
    (adj-car pos3-7 pos3-4)
    (adj-walk pos3-5 pos3-6)
    (adj-walk pos3-6 pos3-5)
    (adj-car pos3-5 pos3-6)
    (adj-car pos3-6 pos3-5)
    (adj-car pos3-5 pos3-7)
    (adj-car pos3-7 pos3-5)
    (adj-car pos3-5 pos3-8)
    (adj-car pos3-8 pos3-5)
    (adj-walk pos3-6 pos3-7)
    (adj-walk pos3-7 pos3-6)
    (adj-walk pos3-6 pos4-6)
    (adj-walk pos4-6 pos3-6)
    (adj-car pos3-6 pos3-7)
    (adj-car pos3-7 pos3-6)
    (adj-car pos3-6 pos3-8)
    (adj-car pos3-8 pos3-6)
    (adj-car pos3-6 pos3-9)
    (adj-car pos3-9 pos3-6)
    (adj-car pos3-6 pos4-6)
    (adj-car pos4-6 pos3-6)
    (adj-walk pos3-7 pos3-8)
    (adj-walk pos3-8 pos3-7)
    (adj-car pos3-7 pos3-8)
    (adj-car pos3-8 pos3-7)
    (adj-car pos3-7 pos3-9)
    (adj-car pos3-9 pos3-7)
    (adj-car pos3-7 pos3-10)
    (adj-car pos3-10 pos3-7)
    (adj-walk pos3-8 pos3-9)
    (adj-walk pos3-9 pos3-8)
    (adj-walk pos3-8 pos4-8)
    (adj-walk pos4-8 pos3-8)
    (adj-car pos3-8 pos3-9)
    (adj-car pos3-9 pos3-8)
    (adj-car pos3-8 pos3-10)
    (adj-car pos3-10 pos3-8)
    (adj-car pos3-8 pos3-11)
    (adj-car pos3-11 pos3-8)
    (adj-car pos3-8 pos4-8)
    (adj-car pos4-8 pos3-8)
    (adj-walk pos3-9 pos3-10)
    (adj-walk pos3-10 pos3-9)
    (adj-car pos3-9 pos3-10)
    (adj-car pos3-10 pos3-9)
    (adj-car pos3-9 pos3-11)
    (adj-car pos3-11 pos3-9)
    (adj-walk pos3-10 pos3-11)
    (adj-walk pos3-11 pos3-10)
    (adj-walk pos3-10 pos4-10)
    (adj-walk pos4-10 pos3-10)
    (adj-car pos3-10 pos3-11)
    (adj-car pos3-11 pos3-10)
    (adj-car pos3-10 pos4-10)
    (adj-car pos4-10 pos3-10)
    (adj-walk pos3-13 pos4-13)
    (adj-walk pos4-13 pos3-13)
    (adj-car pos3-13 pos4-13)
    (adj-car pos4-13 pos3-13)
    (adj-walk pos4-12 pos4-13)
    (adj-walk pos4-13 pos4-12)
    (adj-car pos4-12 pos4-13)
    (adj-car pos4-13 pos4-12)
    (at-car car0 pos3-4)
    (supporter-inside car0)
    (at-prime pos4-8)
)

(:goal
  (and
    (at-prime pos0-13)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_drive-supporter pos3-4 pos3-7 car0)
   deleted: (supporter_turn) (at-car car0 pos3-4)
   added: (prime_turn) (at-car car0 pos3-7)
   goals met: 0 of 1
2. (pri_walk-prime pos4-8 pos3-8)
   deleted: (prime_turn) (at-prime pos4-8)
   added: (supporter_turn) (at-prime pos3-8)
   goals met: 0 of 1
3. (sup_get-out-car-supporter pos3-7 car0)
   deleted: (supporter_turn) (supporter-inside car0)
   added: (prime_turn) (at-supporter pos3-7) (free car0)
   goals met: 0 of 1
4. (pri_walk-prime pos3-8 pos3-7)
   deleted: (prime_turn) (at-prime pos3-8)
   added: (supporter_turn) (at-prime pos3-7)
   goals met: 0 of 1
5. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
6. (pri_get-into-car-prime pos3-7 car0)
   deleted: (prime_turn) (at-prime pos3-7) (free car0)
   added: (supporter_turn) (prime-inside car0)
   goals met: 0 of 1
7. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
8. (pri_drive-prime pos3-7 pos3-10 car0)
   deleted: (prime_turn) (at-car car0 pos3-7)
   added: (supporter_turn) (at-car car0 pos3-10)
   goals met: 0 of 1
9. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
10. (pri_drive-prime pos3-10 pos0-10 car0)
   deleted: (prime_turn) (at-car car0 pos3-10)
   added: (supporter_turn) (at-car car0 pos0-10)
   goals met: 0 of 1
11. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
12. (pri_drive-prime pos0-10 pos0-13 car0)
   deleted: (prime_turn) (at-car car0 pos0-10)
   added: (supporter_turn) (at-car car0 pos0-13)
   goals met: 0 of 1
13. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
14. (pri_get-out-car-prime pos0-13 car0)
   deleted: (prime_turn) (prime-inside car0)
   added: (supporter_turn) (at-prime pos0-13) (free car0)
   goals met: 1 of 1
